namespace Meta.ConfigToolOdin
{
    /// <summary>
    /// Редактор конфигов на Одине.
    /// Должен уметь работать с несколькими конфигами (открытие, работа, сохранение, закрытие)
    /// На выходе должен получится конфиг для меты. Может хранить данные в своем формате и работать с ними как захочется. 
    /// </summary>
    public class MetaConfigOdin
    {
        //Это будет окно - редактор.
        //Должен уметь открывать, сохранять, закрывать конфиги.
        //Должен уметь работать с множествами конфигами (несколько вариаций игры)
        //Должен уметь сохранять данные конфига в формате меты.
        
        //может отдает конфиг в виде объекта.
        //поддерживает нумернацию id в конфиге.
    }

    public class MetaEditor
    {
        
    }


}
