namespace Meta.ConfigOdin
{
    public class BuildingsConfigOdin : ConfigElem
    { 
        //стоимость, время строительства, уровни, ресурсы, что производит, что требует
        //таски с рекрутами?
        //список строений, какие строения доступны игроку (требования?).
        
        // - увеличивает лимит ресурса
        // - прозволяет производить юнитов (доступ к возможности)
        // - позволяет апгрейдить юнитов (доступ к возможности)
        // - производит ресурс (список таск, кот можно запустить)
        
        
        //Подумать, как удобнее будет настраивать игру, таски и тд для ГД.
        //тип если таски принадлежат зданию - тут их и создавать и держать? Будет аналогично игре.
        
        //Здание - Барраки
        //Макс кол-во 
        //Кого и за сколько могут производить? (таски?) Макс количество юнитов ТИпа?
        //? Какие требования для каждого юнитв должны быть выполнены?
        
        //Здание - Шахта. 
        //макс коли-во
        //какие таски по добыче есть на выбор
        //типы тасок - автокомплит, автозапуск?
        
        //Здание - лаборатория 
        //макс кол-во
        //какие апгрейды может выполнять (и как? моментально, за прайс, за дабл прайс)
        //условия? 
        
    }
    
    
    
    
}